app/controllers/orders_controller.rb

INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "asdfasdf"], ["address", "asdfsdf"], ["email", "asdfasdf"], ["pay_type", "Credit Cart"], ["created_at", "2015-09-06 07:27:35.956634"], ["updated_at", "2015-09-06 07:27:35.956634"]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 5]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy( session[:cart_id])

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", nil]]
---
    def set_order
      if @order
         @order = Order.find(params[:id])