app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "kevin"], ["password_digest", "$2a$10$W1SnAT0pvKY1nPsf/gpGieDofIcSq7adBXD.hqrl7LNKVhTLveTl."], ["created_at", "2015-09-06 18:46:23.976986"], ["updated_at", "2015-09-06 18:46:23.976986"]]